Documents/ЛБ_РаспределениеПереплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РаспределениеПереплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_РеестрБезначныхПлатежейПереплаты</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РаспределенныеБезналичныеПлатежи</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РаспределениеПереплаты</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_БезналичныеПлатежиКРаспределению</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыИзмененийБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_РаспределенныеБезналичныеПлатежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РаспределенныеБезналичныеПлатежи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КВозврату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоВыяснения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВДоходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РаспределениеПереплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РаспределениеПереплаты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВДоходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_БезналичныеПлатежиКРаспределению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_БезналичныеПлатежиКРаспределению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыИзмененийБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыИзмененийБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзменения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КЗачислению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляРазбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачисленоПолностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачисленоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоВыяснения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВозврату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтнесеноВДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РаспределениеПереплаты/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Записывать = Истина;
	Движения.ЛБ_РаспределениеПереплаты.Записывать = Истина;  
	Движения.ЛБ_БезналичныеПлатежиКРаспределению.Записывать = Истина;
	Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Записывать = Истина;
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.Изменение Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОплаты) Тогда   
			Если ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату Тогда 
				Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
				Движение.Период = Дата;  
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
				Движение.СуммаПлатежа = СуммаПлатежа;
				Движение.ПереплатаНачальная = ЭтотОбъект.Переплата;  
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа; 
				Движение.Ответственный = ЭтотОбъект.Ответственный; 
			Иначе	
				Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
				Движение.Период = Дата;  
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
				Движение.СуммаПлатежа = СуммаПлатежа;
				Движение.ПереплатаНачальная = ЭтотОбъект.Переплата;  
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
				Движение.Возврат = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено, Переплата, 0);  
				Движение.Ответственный = ЭтотОбъект.Ответственный; 

				Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.СуммаПлатежа = СуммаПлатежа;                
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.Переплата = -Переплата;
				Движение.Возвращено = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено, Переплата, 0); 
				Движение.ВДоходы = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы, Переплата, 0); 
													
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;   
				Движение.СуммаПлатежа = СуммаПлатежа;  
				Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
				Движение.Переплата = -Переплата;
				Если ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
				    Движение.ВДоходы = Переплата;
				ИначеЕсли ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено Тогда
				    Движение.Возвращено = Переплата;	 	
				КонецЕсли;  
				СтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
				Если СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату тогда
					Движение.КВозврату = -СуммаПлатежа; 
				ИначеЕсли СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения тогда
		            Движение.ДоВыяснения = -СуммаПлатежа;
				КонецЕсли;	
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Дата", Дата);
				Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
				Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
				Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
				Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
				               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
				               |ИЗ
				               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
				               |			&Дата,
				               |			РеестрПлатежей = &РеестрПлатежей
				               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
				               |				И НомерЗБ = &НомерЗБ
				               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда  
					Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
				    Движение.Период = Дата;   
					Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
					Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
					Движение.НомерЗБ = Выборка.НомерЗБ; 
					Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
		            Движение.Сумма = Переплата;
				КонецЕсли; 
			КонецЕсли;	
		Иначе //это оплата	  
			СуммаОплаты = ДокументОплаты.СуммаОплатыПроценты + ДокументОплаты.СуммаОплатыСсуда;
			Если Переплата > СуммаОплаты Тогда  
				НоваяПереплата = ЭтотОбъект.Переплата - СуммаОплаты;
			Иначе
				НоваяПереплата = 0;
			КонецЕсли;
			
			Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
			Движение.Период = Дата;  
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.ПереплатаНачальная = ЭтотОбъект.Переплата;  
			Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
			Движение.ОплатаПроценты = ДокументОплаты.СуммаОплатыПроценты;
			Движение.ОплатаЗайм = ДокументОплаты.СуммаОплатыСсуда;
			Движение.Переплата = НоваяПереплата; 			
			Движение.Ответственный = ЭтотОбъект.Ответственный;  
			Движение.ДокументОплаты = ЭтотОбъект.ДокументОплаты;
			
			Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.Переплата = -СуммаОплаты; 

			Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;  
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.ОплатаПроценты = ДокументОплаты.СуммаОплатыПроценты;
			Движение.ОплатаЗайм = ДокументОплаты.СуммаОплатыСсуда;
			Движение.Переплата = НоваяПереплата;  
										
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
			               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
			               |ИЗ
			               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
			               |			&Дата,
			               |			РеестрПлатежей = &РеестрПлатежей
			               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			               |				И НомерЗБ = &НомерЗБ
			               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда  
				СуммаРасход = СуммаОплаты;
				Если СуммаРасход > Выборка.Сумма Тогда
					СуммаРасход = Выборка.Сумма;
					ОбщегоНазначения.СообщитьПользователю("Остаток по безналичным платежам к распределению " + СокрЛП(Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2")) + " меньше оплаты по ЗБ № " + СокрЛП(ЭтотОбъект.ЗалоговыйБилет.НомерЗалоговогоБилета));
				КонецЕсли;	
				Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
			    Движение.Период = Дата;   
				Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
				Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
				Движение.НомерЗБ = Выборка.НомерЗБ; 
				Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
                Движение.Сумма = СуммаРасход;
			КонецЕсли;	       
			
			Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			Движение.Период = Дата;                              
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.СуммаПлатежа = СуммаПлатежа; 
			Движение.ЗалоговыйБилет = ЭтотОбъект.ДокументОплаты.ПредыдущаяОперация;
			Движение.Переплата = -Переплата;   
								
			Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			Движение.Период = Дата;                              
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.СуммаПлатежа = СуммаПлатежа; 
			Движение.ЗалоговыйБилет = ЭтотОбъект.ДокументОплаты.ПредыдущаяОперация;
			Если НЕ ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты = 0 Тогда
			    Движение.ОплатаПроценты = ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты;
			КонецЕсли;
			Если НЕ ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда = 0 Тогда
			    Движение.ОплатаЗайм = ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда;
			КонецЕсли;	
            Если НЕ НоваяПереплата = 0 Тогда
			    Движение.Переплата = НоваяПереплата;
			КонецЕсли;	
        КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.ОтменаИзменения Тогда  
		Запрос = Новый Запрос;    
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
		Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
		Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
		Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);  
		Запрос.УстановитьПараметр("ДокументОплаты", ЭтотОбъект.ДокументОплаты);   
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_РаспределениеПереплаты.Регистратор КАК Регистратор,
		               |	ЛБ_РаспределениеПереплаты.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РаспределениеПереплаты
		               |ГДЕ
		               |	ЛБ_РаспределениеПереплаты.РеестрПлатежей = &РеестрПлатежей
		               |	И ЛБ_РаспределениеПереплаты.НомерЗБ = &НомерЗБ
		               |	И ЛБ_РаспределениеПереплаты.ДатаПлатежа = &ДатаПлатежа
		               |	И ЛБ_РаспределениеПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
		               |	И ЛБ_РаспределениеПереплаты.ДокументОплаты = &ДокументОплаты
		               |	И ЛБ_РаспределениеПереплаты.Период < &Дата
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда  
			НаборЗаписей = РегистрыСведений.ЛБ_РеестрБезначныхПлатежейПереплаты.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 

        	Для каждого Запись Из НаборЗаписей Цикл  
				Движение = Движения.ЛБ_РеестрБезначныхПлатежейПереплаты.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = Запись.РеестрПлатежей;
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
				Движение.НомерЗБ = Запись.НомерЗБ;
				Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.ПереплатаНачальная = Запись.ПереплатаНачальная; 
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
				Движение.ДокументОплаты = Запись.ДокументОплаты;
				Движение.Ответственный = ЭтотОбъект.Ответственный;
				Если Выборка.Регистратор.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
					 Выборка.Регистратор.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
				    Движение.ОтменаСотрудникомЦО = Истина; 
				КонецЕсли;	
				Движение.Переплата = Запись.ПереплатаНачальная;
			КонецЦикла;	  			

			
			НаборЗаписей = РегистрыНакопления.ЛБ_РаспределениеПереплаты.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 

        	Для каждого Запись Из НаборЗаписей Цикл  
				Движение = Движения.ЛБ_РаспределениеПереплаты.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = Запись.РеестрПлатежей;
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
				Движение.НомерЗБ = Запись.НомерЗБ;
				Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.ОплатаПроценты = -Запись.ОплатаПроценты; 
				Движение.ОплатаЗайм = -Запись.ОплатаЗайм;
				Движение.Переплата = -Запись.Переплата;
				Движение.Возвращено = -Запись.Возвращено; 
				Движение.ВДоходы = -Запись.ВДоходы;	
			КонецЦикла;	  
			
		  	НаборЗаписей = РегистрыНакопления.ЛБ_БезналичныеПлатежиКРаспределению.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 
			
			Для каждого Запись Из НаборЗаписей Цикл
				Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.Добавить();
				Движение.Период = Дата;   
				Движение.ВидДвижения = Запись.ВидДвижения;
				Движение.РеестрПлатежей = Запись.РеестрПлатежей; 
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа; 
				Движение.НомерЗБ = Запись.НомерЗБ; 
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.Сумма = -Запись.Сумма;
			КонецЦикла;	
			
			НаборЗаписей = РегистрыНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
            НаборЗаписей.Прочитать(); 
			
			Для каждого Запись Из НаборЗаписей Цикл
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = Запись.РеестрПлатежей;
				Движение.ДатаПлатежа = Запись.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
				Движение.НомерЗБ = Запись.НомерЗБ;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;                 
				Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
				Движение.СуммаПлатежа = Запись.СуммаПлатежа;
				Движение.ОплатаПроценты = -Запись.ОплатаПроценты; 
				Движение.ОплатаЗайм = -Запись.ОплатаЗайм;
				Движение.Переплата = -Запись.Переплата;
				Движение.ВДоходы = -Запись.ВДоходы;
				Движение.Возвращено = -Запись.Возвращено;      
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
